OAT15_simulations/OAT15_DDES_SA_z30/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;

sourceCase ".";
sourcePatches (front);
exposedPatchName back;

flipNormals true;

extrudeModel        linearNormal;

nLayers         30;

linearNormalCoeffs
{
    thickness       0.0735;
}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;

// Merge small edges. Fraction of bounding box.
mergeTol 1e-8;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
